/** @file

Copyright (c) 2006 - 2014, Byosoft Corporation.<BR>
All rights reserved.This software and associated documentation (if any)
is furnished under a license and may only be used or copied in
accordance with the terms of the license. Except as permitted by such
license, no part of this software or documentation may be reproduced,
stored in a retrieval system, or transmitted in any form or by any
means without the express written consent of Byosoft Corporation.

File Name:
  Sata.uni

Abstract:
  The definition of string used in ATA Devices setting.

Revision History:

$END--------------------------------------------------------------------

**/

/=#
#langdef   zh-Hans "\wide中文\narrow"
#langdef   en-US "English"


#string STR_SATA_FORM                      #language en-US "SATA Configuration"
                                           #language zh-Hans "SATA \wide设备菜单\narrow"
#string STR_SATA_FORM_HELP                 #language en-US "Select this option to configure your system's ATA drive."
                                           #language zh-Hans "\wide选择此选项可配置系统的\narrowATA\wide驱动器.\narrow"
#string STR_SATA_CONTROLLER                #language en-US "SATA Controller"
                                           #language zh-Hans "SATA \wide控制器\narrow"
#string STR_SATA_CONTROLLER_HELP           #language en-US "Select whether to enable or disable SATA controller."
                                           #language zh-Hans "\wide选择是否支持\narrowSATA\wide设备。\narrow"
#string STR_SATA_DRIVE1                    #language en-US "SATA Drive 1"
                                           #language zh-Hans "SATA \wide驱动器\narrow1"
#string STR_SATA_DRIVE1_HELP               #language en-US "Select whether to enable or disable SATA drive 1."
                                           #language zh-Hans "\wide选择是否打开\narrowSATA\wide驱动器1。\narrow"
#string STR_SATA_DRIVE2                    #language en-US "SATA Drive 2"
                                           #language zh-Hans "SATA \wide驱动器\narrow2"
#string STR_SATA_DRIVE2_HELP               #language en-US "Select whether to enable or disable SATA drive 2."
                                           #language zh-Hans "\wide选择是否打开\narrowSATA\wide驱动器2。\narrow"
#string STR_SATA_MODE                      #language en-US "Configure SATA as"
                                           #language zh-Hans "\wide配置\narrowSATA\wide 为\narrow"
#string STR_SATA_MODE_HELP                 #language en-US "Select IDE/AHCI Mode. NOTE: Device driver support is required  for AHCI. Depending on how the hard disk image was installed, changing this setting may prevent the system from booting."
                                           #language zh-Hans "\wide选择\narrowIDE\wide或\narrowAHCI\wide模式。 \n注意：设备驱动支持\narrowAHCI\wide或者\narrowRAID\wide模式取决于硬盘如何安装。改变这个设定可能引起无法从系统启动。\narrow"
#string STR_SATA_MODE_IDE                  #language en-US "IDE"
                                           #language zh-Hans "IDE"
#string STR_SATA_MODE_RAID                 #language en-US "RAID"
                                           #language zh-Hans "RAID"
#string STR_SATA_MODE_AHCI                 #language en-US "AHCI"
                                           #language zh-Hans "AHCI"
#string STR_SATA_MODE_OPERATION            #language en-US "Native Mode Operation"
                                           #language zh-Hans "\wide  Native模式工作\narrow"
#string STR_SATA_MODE_OPERATION_HELP       #language en-US "Choose native mode for ATA. NOTE: Certain OS is not supported under native mode."
                                           #language zh-Hans "\wide配置\narrowATA\wide设备为\narrownative\wide模式工作。 注意: 某些操作系统不支持在\narrownative\wide模式工作。\narrow"
#string STR_HARD_DISK_PRE_DELAY            #language en-US "Hard Disk Pre-delay"
                                           #language zh-Hans "\wide硬盘预延迟\narrow"
#string STR_HARD_DISK_PRE_DELAY_HELP       #language en-US "Adds a delay before the first access of a hard disk by the system software. Some hard disks hang if accessed before they have initialized themselves. This delay ensures the hard disk has initialized after power up, prior to being accessed."
                                           #language zh-Hans "\wide在软件访问硬盘时添加延迟，有些硬盘在没有完全初始化完毕时访问会死机，这个延迟保证硬盘在开机完全被初始化后被访问。\narrow"
#string STR_DELAY_3SECONDES                #language en-US "3 Seconds"
                                           #language zh-Hans "\wide3 秒\narrow"
#string STR_DELAY_6SECONDES                #language en-US "6 Seconds"
                                           #language zh-Hans "\wide6 秒\narrow"
#string STR_DELAY_9SECONDES                #language en-US "9 Seconds"
                                           #language zh-Hans "\wide9 秒\narrow"
#string STR_DELAY_12SECONDES               #language en-US "12 Seconds"
                                           #language zh-Hans "\wide12 秒\narrow"
#string STR_DELAY_15SECONDES               #language en-US "15 Seconds"
                                           #language zh-Hans "\wide15 秒\narrow"
#string STR_DELAY_21SECONDES               #language en-US "21 Seconds"
                                           #language zh-Hans "\wide21 秒\narrow"
#string STR_DELAY_30SECONDES               #language en-US "30 Seconds"
                                           #language zh-Hans "\wide30 秒\narrow"

#string STR_SATA_CHANNEL_MODE              #language en-US "Channel Operating Mode"
                                           #language zh-Hans "Channel Operating Mode"
#string STR_SATA_CHANNEL_MODE_HELP         #language en-US "Compatibility: Resource and IRQ is fixed for SATA device; Native PCI: Resource and IRQ is assigned by BIOS."
                                           #language zh-Hans "Compatibility: Resource and IRQ is fixed for SATA device; Native PCI: Resource and IRQ is assigned by BIOS."
#string STR_SATA_CHANNEL_MODE_0            #language en-US "Compatibility"
                                           #language zh-Hans "Compatibility"
#string STR_SATA_CHANNEL_MODE_1            #language en-US "Native PCI"
                                           #language zh-Hans "Native PCI"
#string STR_SATA_ODD                       #language en-US "Force HIPM/DIPM Disabled for ODD"
                                           #language zh-Hans "Force HIPM/DIPM Disabled for ODD"
#string STR_SATA_ODD_HELP                  #language en-US "Enabled: enable this feature will force SATA port with ODD device (or no device) to support Hot Plug only In otherwords, ODD will not enter power mode no matter user has enabled HIPM/DIPM or not; Disabled: disable this feature will let user to enable/disable HIPM/DIPM by BIOS item."
                                           #language zh-Hans "Enabled: enable this feature will force SATA port with ODD device (or no device) to support Hot Plug only In otherwords, ODD will not enter power mode no matter user has enabled HIPM/DIPM or not; Disabled: disable this feature will let user to enable/disable HIPM/DIPM by BIOS item."
#string STR_SATA_PMP                       #language en-US "Support PMP during BIOS POST"
                                           #language zh-Hans "Support PMP during BIOS POST"
#string STR_SATA_PMP_HELP                  #language en-US "Support PMP during BIOS POST"
                                           #language zh-Hans "Support PMP during BIOS POST"
#string STR_PORT1_ESATA                    #language en-US "eSATA Support for Port1"
                                           #language zh-Hans "eSATA Support for Port1"
#string STR_PORT1_ESATA_HELP               #language en-US "Enabled: eSATA cable Driving in port1; Disabled: Normal cable Driving in port1."
                                           #language zh-Hans "Enabled: eSATA cable Driving in port1; Disabled: Normal cable Driving in port1."
#string STR_SATA_LINUX_PATCH               #language en-US "Linux SATA Patch"
                                           #language zh-Hans "Linux SATA Patch"
#string STR_SATA_LINUX_PATCH_HELP          #language en-US "Linux SATA Patch"
                                           #language zh-Hans "Linux SATA Patch"
#string STR_SATA_ASYNC_RECOVERY            #language en-US "Continuous Async Recovery"
                                           #language zh-Hans "Continuous Async Recovery"
#string STR_SATA_ASYNC_RECOVERY_HELP       #language en-US "Limit Continuous Asynchronous Recovery to five times only for IDE and RAID."
                                           #language zh-Hans "Limit Continuous Asynchronous Recovery to five times only for IDE and RAID."
#string STR_SATA_ASYNC_RECOVERY_0          #language en-US "NoLimit"
                                           #language zh-Hans "NoLimit"
#string STR_SATA_ASYNC_RECOVERY_1          #language en-US "LimitToFive"
                                           #language zh-Hans "LimitToFive"
#string STR_SB_OTHERS_FORM                 #language en-US "Others Configuration"
                                           #language zh-Hans "Others Configuration"
#string STR_SB_OTHERS_FORM_HELP            #language en-US "Others Configuration Parameters"
                                           #language zh-Hans "Others Configuration Parameters"
#string STR_SATA_RAID_FUNCTION             #language en-US "RAID Function Select"
                                           #language zh-Hans "RAID Function Select"
#string STR_SATA_RAID_FUNCTION_HELP        #language en-US "AHCI Mode: RAID function to work in AHCI mode; IDE Mode: RAID function to work in IDE mode."
                                           #language zh-Hans "AHCI Mode: RAID function to work in AHCI mode; IDE Mode: RAID function to work in IDE mode."
#string STR_SATA_RAID_FUNCTION_0           #language en-US "IDE Mode"
                                           #language zh-Hans "IDE Mode"
#string STR_SATA_RAID_FUNCTION_1           #language en-US "AHCI Mode"
                                           #language zh-Hans "AHCI Mode"
#string STR_SATA_RAID_VIEWER_EXIT          #language en-US "RAID Viewer Auto Exit Waiting Time"
                                           #language zh-Hans "RAID Viewer Auto Exit Waiting Time"
#string STR_SATA_RAID_VIEWER_EXIT_HELP     #language en-US "Time in seconds to wait before auto exiting  StorX RAID Viewer when RAID is abnormal."
                                           #language zh-Hans "Time in seconds to wait before auto exiting  StorX RAID Viewer when RAID is abnormal."
#string STR_ACHI_HOT_PLUG                  #language en-US "ACHI Port0 Hot-Plug Cap"
                                           #language zh-Hans "ACHI Port0 Hot-Plug Cap"
#string STR_ACHI_HOT_PLUG_HELP             #language en-US "Enable AHCI Hot-Plug Capability for Port0."
                                           #language zh-Hans "Enable AHCI Hot-Plug Capability for Port0."
#string STR_ACHI_HOT_PLUG_PORT1            #language en-US "ACHI Port1 Hot-Plug Cap"
                                           #language zh-Hans "ACHI Port1 Hot-Plug Cap"
#string STR_ACHI_HOT_PLUG_PORT1_HELP       #language en-US "Enable AHCI Hot-Plug Capability for Port1."
                                           #language zh-Hans "Enable AHCI Hot-Plug Capability for Port1."
#string STR_ACHI_HOT_PLUG_PATCH            #language en-US "AHCI Hot Plug-out Patch"
                                           #language zh-Hans "AHCI Hot Plug-out Patch"
#string STR_ACHI_HOT_PLUG_PATCH_HELP       #language en-US "In AHCI mode, Hot Plug-Out Patch to use GP3 timer auto refresh for VT3456A0/A1."
                                           #language zh-Hans "In AHCI mode, Hot Plug-Out Patch to use GP3 timer auto refresh for VT3456A0/A1."
#string STR_ACHI_HIPM_TIMER                #language en-US "Support AHCI HIPM shortest Timer"
                                           #language zh-Hans "Support AHCI HIPM shortest Timer"
#string STR_ACHI_HIPM_TIMER_HELP           #language en-US "Support AHCI HIPM shortest Timer"
                                           #language zh-Hans "Support AHCI HIPM shortest Timer"
#string STR_ACHI_HIPM_TIMER_0              #language en-US "Shortest"
                                           #language zh-Hans "Shortest"
#string STR_ACHI_HIPM_PATCH                #language en-US "Patch HIPM for AHCI Power Mode"
                                           #language zh-Hans "Patch HIPM for AHCI Power Mode"
#string STR_ACHI_HIPM_PATCH_HELP           #language en-US "In some SATA Device, system will random hang during S3 resume in AHCI power mode, So BIOS can offer patch code for AHCI power mode after S3 resume."
                                           #language zh-Hans "In some SATA Device, system will random hang during S3 resume in AHCI power mode, So BIOS can offer patch code for AHCI power mode after S3 resume."
                                        
#string STR_SATA_CFG                      #language en-US "SATA Mode"
#string STR_SATA_CFG_HELP                 #language en-US "SATA Configure"
#string  STR_IDE                          #language en-US "IDE"
#string  STR_RAID                         #language en-US "RAID"
#string  STR_AHCI                         #language en-US "AHCI"
#string  STR_SATA_CHANNEL_MODE            #language en-US "Channel Operating Mode"
#string  STR_SATA_CHANNEL_MODE_HELP       #language en-US "Compibility:Resource and IRQ is fixed for SATA device;Native PCI: Resource and IRQ is assigned by BIOS"
#string  STR_COMPILITY                    #language en-US "Compatibility"
#string  STR_NATIVE                       #language en-US "Native PCI"
#string  STR_AHCI_EN                      #language en-US "RAID Function Select"
#string  STR_AHCI_EN_HELP                 #language en-US "AHCI mode:RAID function to work in AHCI mode                                                IDE mode: RAID function to work in IDE mode"
#string  STR_IDE_MODE                     #language en-US "IDE Mode"
#string  STR_AHCI_MODE                    #language en-US "AHCI Mode"
#string  STR_IDE_CAP_SELECT               #language en-US "IDE All Port Driver Cap Select"
#string  STR_IDE_CAP_SELECT_HELP          #language en-US "IDE Port Capability flag for SATA driver;"
#string  STR_HOTPLUG                      #language en-US "Hot-Plug"
#string  STR_LINKPM                       #language en-US "Link-PM"
#string  STR_IDE_HIPM_EN                  #language en-US "HIPM function All Port"
#string  STR_IDE_HIPM_EN_HELP             #language en-US "SATA HIPM function control;"
#string  STR_IDE_DIPM_EN                  #language en-US "All Port DIPM Enable in BIOS"
#string  STR_IDE_DIPM_EN_HELP             #language en-US "Enable DIPM for All Port in BIOS"
#string  STR_DISABLED                     #language en-US "Disabled"
#string  STR_ENABLED                      #language en-US "Enabled"
#string  STR_AHCI_HPCP_EN                 #language en-US "AHCI All Port HotPlug Cap"
#string  STR_AHCI_HPCP_EN_HELP            #language en-US "Enable AHCI HotPlug Capability for All Port"
#string  STR_AHCI_ALPM_EN                 #language en-US "AHCI Link Power Management"
#string  STR_AHCI_ALPM_EN_HELP            #language en-US "Enable AHCI Aggressive Link Power Management for All Port"

#string  STR_SUND_WAIT_TIME               #language en-US "RAID Viewer Auto Exit Waiting Time"
#string  STR_SUND_WAIT_TIME_HELP          #language en-US "Time in seconds to wait before auto exiting  StorX RAID Viewer when RAID is abnormal. 0-255, 0 sec means waiting until exit key is pressed."
#string  STR_SUP_HIPMTIMER                #language en-US "Support AHCI HIPM shortest Timer"
#string  STR_SUP_HIPMTIMER_HELP           #language en-US "Support AHCI HIPM shortest Timer select"
#string  STR_DISABLE                      #language en-US "Disable"
#string  STR_SHORTEST                     #language en-US "Shortest"
#string  STR_NORMAL                       #language en-US "Normal"
#string  STR_SATA_ASYN_RECOVERY           #language en-US "Continuous Async Recovery"
#string  STR_SATA_ASYN_RECOVERY_HELP      #language en-US "Limit Continuous Asynchronous Recovery to Five Times Only for IDE and RAID"
#string  STR_NO_LIMIT                     #language en-US "No Limit"
#string  STR_LINIT_TO_FIVE                #language en-US "Limit to Five"
#string  STR_SATA_FUNC_LEV_EN             #language en-US "Function Level Reset Enabled"
#string  STR_SATA_FUNC_LEV_EN_HELP        #language en-US "Enable Function Level Reset in BIOS"

#string  STR_IDE_GEN                      #language en-US "Force SATA Speed setting"
#string  STR_AHCI_GEN                     #language en-US "Force SATA Speed setting"
#string  STR_IDE_GEN_HELP                 #language en-US "Gen1/Gen2/Gen3"
#string  STR_AHCI_GEN_HELP                #language en-US "Gen1/Gen2/Gen3"
#string  STR_GEN1                         #language en-US "Gen1"
#string  STR_GEN2                         #language en-US "Gen2"
#string  STR_GEN3                         #language en-US "Gen3"
#string  STR_AHCI_MSI                     #language en-US "AHCI Support MSI"
#string  STR_AHCI_MSI_HELP                #language en-US "Enable MSI in BIOS"
#string  STR_AHCI_MSIX                    #language en-US "AHCI Support MSI-X"
#string  STR_AHCI_MSIX_HELP               #language en-US "Enable MSI-X in BIOS"
#string  STR_IDE_LINUX_PATCH_EN           #language en-US   "IDE Linux Installation Patch"
                                          #language zh-Hans "IDE Linux Installation Patch"
#string  STR_IDE_LINUX_PATCH_EN_HELP      #language en-US   "Modify DeviceID to Patch Linux Installation"
                                          #language zh-Hans "Modify DeviceID to Patch Linux Installation"
#string  STR_SATA_DRIVE0_NAME             #language en-US   "SATA Drive 0"
#string  STR_SATA_DRIVE0_VALUE            #language en-US   "Not Present"
#string  STR_SATA_DRIVE1_NAME             #language en-US   "SATA Drive 1"
#string  STR_SATA_DRIVE1_VALUE            #language en-US   "Not Present"
#string  STR_SATA_DRIVE2_NAME             #language en-US   "SATA Drive 2"
#string  STR_SATA_DRIVE2_VALUE            #language en-US   "Not Present"
#string  STR_SATA_DRIVE3_NAME             #language en-US   "SATA Drive 3"	

#string  STR_GB_FLUSHEND_EN               #language en-US   "SATA GB_FLUSHEND Enabled"
#string  STR_GB_FLUSHEND_EN_HELP          #language en-US   "Enable GB_FLUSHEND in BIOS"
									  
